Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>PZ8O9OS0cVUEyy2QPeXf2+d+5GclwzJD+Qbo33xyAHYMNHdJM/juwdrWVmdMzX7HP8I+06UhgxRu&#13;
hT0vx3h4F+g4NUogtLqZvXduAotcop10aEF6xy/1D7XO9hrHpInguWufZ2bYJzY9QN5ODYqPJdiQ&#13;
HGvw+TX78TmDaOnhBYZ7QNC0rnPSF3JTYB8vElFrDm+f4afF44kxRm6n5TwWAk9hpAQ79m2YcZql&#13;
ZBMjh1gUgPcr2ebI28JOPdDAuY7RN5mgpd/ppozgzZeDNk6N1ANPtSN9ldVYjEh1zycSizsnCv9j&#13;
2G1Fsxxg+VtI+OEXr3IHKeUAaOZq1Rc0YIomqA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>VnLC8D+xkse47izIDrmN7hiEVs1617r8JEh/RGZB5tqjmC3MO7/Ko/0Av8TJsLWxfVJZWRPPKWSB&#13;
u6ALOlCP+ZFMtgQYVAmSdMEoVFig5JqYCT7lz+zTf28coPkGW5uDRxtVsF+IWxyT0goMYFQwh7Fl&#13;
+xfuGkwZbyBIWbnKJAxqTMTaZ3Sn2kXsTNp7kTzwGvsZgVInEqrqpOPfTlkMYG4zrI26tGb3P7tu&#13;
9vaFxyXCH5mkOmrVBrqjenziUsuo1q4oC/7b4jnolDbdkhdJkTSKV0Uo2CXplklIzJ7uRhvw74c1&#13;
celoMs+dFl9xhZPj+3/N+fY3COy7e0LbAyGwDJ5byuAMnTgY0WiKY9lxwZRDnj2BPlHSFqmOu72a&#13;
ZWNqqYAVTTdYTJuCj1NXhg2v7dnJF6atU/REHYxkDu6JiZAREV+TQXbkI7dc6suY7VquVa7X/uXg&#13;
uyHxXxLQh5xXOYY37jP/5mLK0pd0ODCTLj+tqZs+YCh3f34Rb2UMZN09Y2+RxaNFPxTgaE+10ilb&#13;
oJWbIlxz3RxyoMPE/518drXxD4aYPcMFMwIr0Po9s7CyBpTF7pEK8Y0eyaLAY5s+M1jHdfkvXzbj&#13;
+sGP5Ddv8Cz4GOvxS1MQdvJ0tBiQGU3r1jloCtoNc9CCoCD1PwB/eF36eoJvTskA8X+hIBOxKZjF&#13;
x/Fum7vizFF1shUBAtu3lWlPkhw0pityadxz97dVSTrskk3NylTt818KXARjdBxum2UmEMrGpIIw&#13;
DlZD6NiJt6PiWKvz/VgZkYTsxsGbGwH/s1qtUaDq1ppaad9CpCtzAaBKsjito3f1wtlPSk4r8hPX&#13;
a8ToOqhdOrKoK438v5yg8D3S66mrGlZ/dp1iASKQtwXcGXrnTRo+k8zhZUIInT4Cf5DVflq/ZiYa&#13;
1ah/tBHzbUZ33RxOH6dVsArplW7d4b3MGa4pA+Y9C8+iQb3gut2A157+9YDPM0ihjytRwb2fQ5cC&#13;
pB0y</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>GGdFAtOx/z29ea6irO+Iw2qMurA=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
J9hwGb+TnqkHGo8ITI4G6kAONSqua+J6x48Ne0LtpoX8zHzCRNYGwNAyEVRlCdAnvPQRIFC6e9s/&#13;
SPy5lwZAw0kwOW87hkjKJIShxfaX68264gyXHXe1W7QnOnxQy/qjjf+80Jc+pd1iT5ig4DUqJmee&#13;
CMKfgNgqRTYkR0O1MVmT/hK57yNG+lMzpnKCbWE1I0BmjKoTzDO3rlI0q1LDrvo0pSnLZ/en1X30&#13;
hTuTUV1vdr7hfUold+o5RaSS8Q0fBw0qvhZZaeqKQrVhlXACzcv3hTiYe7ijpbWMcClELY+Dn6dF&#13;
6dERiOaf41piQchbK9OYe7JHZEg0BnUG7fb2mw==
</ds:SignatureValue>
<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>